Sample API/CreateIssuingContractWithLiabilityV2_REQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsin="http://www.openwaygroup.com/wsint">
   <soapenv:Header>
      <wsin:SessionContextStr>?</wsin:SessionContextStr>
      <wsin:UserInfo>officer="WX_ADMIN"</wsin:UserInfo>
      <wsin:CorrelationId>?</wsin:CorrelationId>
   </soapenv:Header>
   <soapenv:Body>
      <wsin:CreateIssuingContractWithLiabilityV2>
      	<wsin:LiabCategory>Y</wsin:LiabCategory>
      	<wsin:LiabContractSearchMethod>CONTRACT_NUMBER</wsin:LiabContractSearchMethod>
      	<wsin:LiabContractIdentifier>LIAB</wsin:LiabContractIdentifier>
         	<wsin:ClientSearchMethod>CLIENT_NUMBER</wsin:ClientSearchMethod>
         	<wsin:ClientIdentifier>099773245419</wsin:ClientIdentifier>
         	<wsin:ProductCode>MC_CR_GLD</wsin:ProductCode>
         	<wsin:ProductCode2></wsin:ProductCode2>
          <wsin:ProductCode3></wsin:ProductCode3>
         <wsin:InObject>
            <wsin:Branch>001</wsin:Branch>
            <wsin:InstitutionCode>0001</wsin:InstitutionCode>
            <wsin:ContractName>Issuing Contract</wsin:ContractName>
            <wsin:CBSNumber>213245566000</wsin:CBSNumber>
            <wsin:AddInfo01>PAYMENT_OPTION=MTP;START_DATE=0123;BANK=A1;ACCOUNT=A2;BANK_CODE=A3;ACC_NAME=A4;</wsin:AddInfo01>
            <wsin:AddInfo02>PAYMENT_OPTION=MTP;</wsin:AddInfo02>
         </wsin:InObject>  
      </wsin:CreateIssuingContractWithLiabilityV2>
   </soapenv:Body>
</soapenv:Envelope>

<s:Envelope xmlns:s='http://schemas.xmlsoap.org/soap/envelope/'>
    <s:Body>
        <CreateContractV4Response xmlns="http://www.openwaygroup.com/wsint" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <CreateContractV4Result>
                <CreatedContract>360210</CreatedContract>
                <ContractNumber>001-P-557666</ContractNumber>
                <ApplicationNumber>50736979308290</ApplicationNumber>
                <CBSNumber>21324556600</CBSNumber>
                <RetCode>0</RetCode>
                <RetMsg>I Successfully Completed</RetMsg>
                <ResultInfo> officer="WX_ADMIN"</ResultInfo>
            </CreateContractV4Result>
        </CreateContractV4Response>
    </s:Body>
</s:Envelope>

<s:Envelope xmlns:s='http://schemas.xmlsoap.org/soap/envelope/'>
    <s:Body>
        <CreateIssuingContractWithLiabilityV2Response xmlns="http://www.openwaygroup.com/wsint" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <CreateIssuingContractWithLiabilityV2Result>
                <CreatedContract>360220</CreatedContract>
                <ContractNumber>001-P-755420</ContractNumber>
                <ApplicationNumber>50736992308400</ApplicationNumber>
                <CBSNumber>213245566000</CBSNumber>
                <RetCode>0</RetCode>
                <RetMsg>I Successfully Completed</RetMsg>
                <ResultInfo> officer="WX_ADMIN"</ResultInfo>
            </CreateIssuingContractWithLiabilityV2Result>
        </CreateIssuingContractWithLiabilityV2Response>
    </s:Body>
</s:Envelope>

<s:Envelope xmlns:s='http://schemas.xmlsoap.org/soap/envelope/'>
    <s:Body>
        <CreateCardV3Response xmlns="http://www.openwaygroup.com/wsint" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <CreateCardV3Result>
                <CreatedCard>360250</CreatedCard>
                <CardNumber>1000010104664450</CardNumber>
                <ExpiryDate>2601</ExpiryDate>
                <SequenceNumber>1</SequenceNumber>
                <CBSNumber>213245566000</CBSNumber>
                <RetCode>0</RetCode>
                <RetMsg>I Successfully Completed</RetMsg>
                <ResultInfo> officer="WX_ADMIN"</ResultInfo>
            </CreateCardV3Result>
        </CreateCardV3Response>
    </s:Body>
</s:Envelope>
